import React from 'react';
import Heading from '../../components/heading';
import Paragraph from '../../components/paragraph';
import Section from '../../components/section';

const Hardware = () => (
  <div>
    <Heading>Аппаратное обеспечение</Heading>
    <Paragraph>
      Аппара́тное обеспече́ние, аппаратные средства, компьютерные комплектующие,
      «железо», (англ. hardware) — электронные и механические части
      вычислительного устройства, входящие в состав системы или сети, исключая
      программное обеспечение и данные (информацию, которую вычислительная
      система хранит и обрабатывает). Аппаратное обеспечение включает:
      компьютеры и логические устройства, внешние устройства и диагностическую
      аппаратуру, энергетическое оборудование, батареи и аккумуляторы. К
      аппаратному обеспечению относятся устройства, образующие конфигурацию
      компьютера.
    </Paragraph>
    <Paragraph>
      Различают внутренние и внешние устройства. Согласование между отдельными
      узлами и блоками выполняется с помощью аппаратно-логических устройств,
      называемых аппаратными интерфейсами; стандарты на аппаратные интерфейсы
      называют протоколами. Персональный компьютер — универсальная техническая
      система, конфигурацию которой можно изменять по мере необходимости.
    </Paragraph>
    <Section>Компьютер</Section>
    <Paragraph>К аппаратному обеспечению обычно относят:</Paragraph>
  </div>
);

export default Hardware;
